price = int(input('Enter total price: ')) # отримуємо суму від користувача
coins = [10, 20, 50, 100, 200, 500, 1000] # лист купюр
count_of_coins = [0] * 7 # лист, який відповідає за кількість кожної купюри у відповіді
for i in range(len(coins) - 1, -1, -1): # проходимо по усім купюрам
    while 10 * sum(coins[:i]) < price:
        count_of_coins[i] += 1
        price -= coins[i]
# виводимо результат
for i in range(len(count_of_coins)):
    print(f'number of {coins[i]} bill : {count_of_coins[i]}')

# по суті ми в цій задачі розділяємо відповідь на проміжки: 1) від 0 до 100, 2) від 100 до 300, 3) від 300 до 800, 4) від 800 до 1800, 5) від 1800 до 3800, 6) від 3800 до 8800, 7) від 8800 до 18800
# якщо число находится в i-му проміжку, тоді нам необхідно використати купюру, номіналом coins[i], купюри coins[i:], якраз не треба, бо ми можемо видати суму без них
# задача взагалі зводиться до видачі максимальної кількості купюр
# задачу розв'язуємо схожим чином з задачою про монетки (динамічне програмування)